---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewUV
source: html/3f727dcd-1fab-dd8f-1198-d276cd81d10f.htm
---
# Autodesk.Revit.Creation.Application.NewUV Method

Creates a UV object at the origin.

## Syntax (C#)
```csharp
public UV NewUV()
```